###
# zad70
# mu_A = средна оценка при падане на вариант А
# mu_B = средна оценка при падане на вариант В
# H0: mu_A = mu_B
# H1: mu_A > mu_B

examAB <- read.table( "examAB.txt", header=T )
x <- examAB$points[examAB$variant=="A"]
y <- examAB$points[examAB$variant=="B"]
t.test( x, y, alternative="greater" )

# p.value = 0.01668 < 0.05
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Имаме основание да твърдим, че в средно студентите получават 
# по-малко точки ако им се е падне вариант В.

# алтернативен синтаксис
t.test( points ~ variant, data=examAB, alternative="greater" )


###
# zad71
# mu_X = средно време на реакция преди изпиване на 50 мл водка
# mu_Y = средно време на реакция след изпиване на 50 мл водка
# H0: mu_X = mu_Y
# H1: mu_X < mu_Y

react <- read.table( "reacttime.txt", header=T )
x <- react$before
y <- react$after
t.test( x, y, alternative="less", paired=T )
options(scipen=99)
t.test( x, y, alternative="less", paired=T )$p.value

# това ни дава същия резултат
t.test( x-y, alternative="less" )

# p.value = 0.000000000324 < 0.05
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Имаме основание да твърдим, че след изпиване на 50 мл водка
# времето на реакция в средно се увеличава.


###
# zad72
# p_A = вероятност машина А да произведе дефектен болт
# p_B = вероятност машина B да произведе дефектен болт
# H0: p_A = p_B
# H1: p_A != p_B

x <- c(8, 15)
n <- c(200, 200)

prop.test( x=x, n=n, correct=F )
prop.test( x, n, correct=F )

# p.value = 0.1327 > 0.05
# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основание да твърдим, че двете машини се различават
# по отношение на вероятността да произведат дефектен болт.


###
# zad73
# mu_X = средно съдържание на примеси при определяне по метод 1
# mu_Y = средно съдържание на примеси при определяне по метод 2
# H0: mu_X = mu_Y
# H1: mu_X != mu_Y

# копирали сме таблицата с данни (без заглавния ред) в "zad73.txt"
zad73 <- read.table( "zad73.txt" )
x <- zad73[,2]
y <- zad73[,3]

t.test( x, y, paired=T )

# p.value = 0.01026 < 0.05
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Не може да се приеме, че двата метода
# дават в средно едни и същи резултати.

d <- x - y
n <- length(d)
t.obs <- mean(d)/(sd(d)/sqrt(n))
t.obs
p.value <- 2*(1-pt(abs(t.obs), n-1))
p.value 


###
# zad74
# mu_X = средно време за четене при първия шрифт
# mu_Y = средно време за четене при втория шрифт
# H0: mu_X = mu_Y
# H1: mu_X != mu_Y

x.bar <- 7.88
s.x <- 1.73
y.bar <- 8.48
s.y <- 2.12
n <- 50
m <- 50

t.obs <- (x.bar - y.bar) / sqrt(s.x^2/n + s.y^2/m)
t.obs
df <- (s.x^2/n + s.y^2/m)^2 / (((s.x^2/n)^2)/(n-1) + ((s.y^2/m)^2)/(m-1))
df
p.value <- 2*(1-pt(abs(t.obs), df))
p.value 

# p.value = 0.1243729 > 0.05
# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основание да твърдим, че средното време за четене  
# е различно за двата шрифта.


###
# zad75
# p1 = вероятност някой да е вегетарианец през 2007
# p2 = вероятност някой да е вегетарианец през 2019
# H0: p1 = p2
# H1: p1 < p2

x <- c(26, 43)
n <- c(500, 540)
prop.test( x=x, n=n, alternative="less", correct=F )

# p.value = 0.03683 < 0.05
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Имаме основание да твърдим, че процентът на вегетарианците 
# през 2019 година се е увеличил спрямо 2007 година.


###

