###
# zad14 
# X = брой шестици при 10 хвърляния на зар
# X ~ Bi(n=10, p=1/6)

n <- 10
p <- 1/6

# P(X=2)
dbinom(2, n, p)

# P(X<=2)
pbinom(2, n, p)

# P(X>=2) = 1 - P(X<=1)
1 - pbinom(1, n, p)


###
# zad15
# X = брой хвърляния до първа шестица (вкл.)
# X ~ Ge(p=1/6)

p <- 1/6

# P(X<=10)
pgeom(10-1, p)

# P(X>=6) = 1 - P(X<=5)
1 - pgeom(5-1, p)


###
# zad16
# X = брой хвърляния докато се паднат 3 шестици (вкл.)
# X ~ NB(r=3, p=1/6)

r <- 3
p <- 1/6

# P(X<=20)
pnbinom(20-r, r, p)


###
# zad17
# X = брой нови батерии от избраните

# P(X=2)
dhyper(2, 5, 3, 2)


###
# zad18
# X = брой грешки на 1500 думи
# X ~ Bi(n=1500, p=1/500)

n <- 1500
p <- 1/500

# P(X<=2)
pbinom(2, n, p)
ppois(2, n*p)

# P(1<=X<=3) = P(X=1) + P(X=2) + P(X=3)
dbinom(1, n, p) + dbinom(2, n, p) + dbinom(3, n, p)
sum( dbinom( c(1:3), n, p ) )
# P(1<=X<=3) = P(X<=3) - P(X<=0)
pbinom(3, n, p) - pbinom(0, n, p)
ppois(3, n*p) - ppois(0, n*p)


###
# zad19
# X = брой верни отговори на теста
# X ~ Bi(n=10, p=1/4)

n <- 10
p <- 1/4

# P(X>=5) = 1 - P(X<=4)
1 - pbinom(4, n, p)


###
# zad20
# въпрос 1
# X = брой тествани до намиране на първия доброволец с дадения ген (вкл.)
# X ~ Ge(p=0.1)

p <- 0.1

# P(X>=5) = 1 - P(X<=4)
1 - pgeom(4-1, p)

# въпрос 2
# X = брой тествани до намиране на 10 доброволци с дадения ген (вкл.)
# X ~ NB(r=10, p=0.1)

r <- 10
p <- 0.1

# P(X>=50) = 1 - P(X<=49)
1 - pnbinom(49-r, r, p)


###

