###
# zad64
# mu = средна дължина на дясното ухо на жените (18-30 години)
# H0: mu = 60
# H1: mu != 60

x.bar <- 61.9
sigma <- 4.1
n <- 66
mu <- 60
z.obs <- (x.bar-mu)/(sigma/sqrt(n))
z.obs
p.value <- 2*(1-pnorm(abs(z.obs)))
p.value

# p.value = 0.000167 < 0.05 
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Имаме основание да твърдим, че средната дължина на дясното ухо 
# на жените на възраст между 18 и 30 години е различна от 60 мм.


###
# zad65
# mu = средна концентрация на кадмий в горските гъбите
# H0: mu = 4
# H1: mu < 4

x <- c(3.1, 3.0, 3.7, 2.6, 4.2, 3.8, 3.6, 2.7, 3.8, 4.4)
mu <- 4
n <- length(x)
t.obs <- (mean(x)-mu)/(sd(x)/sqrt(n))
t.obs
p.value <- pt(t.obs, n-1)
p.value

t.test( x, mu=4, alternative="less" )

# p.value = 0.0137 < 0.05
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Имаме основание да твърдим, че средната концентрация на кадмий
# в горските гъбите в дадената местност е по-малко от 4 мг/кг.


###
# zad66
# p = вероятност гълъб от дадения вид да намери пътя към дома си
# H0: p = 0.51
# H1: p > 0.51

x <- 22
n <- 38 
p <- 0.51
z.obs <- (x/n - p)/sqrt(p*(1-p)/n)
z.obs
p.value <- 1-pnorm(z.obs)
p.value

prop.test( x=22, n=38, p=0.51, alternative="greater", correct=F )

# p.value = 0.1976 > 0.05
# => нямаме основание да отвърлим нулевата хипотеза.
# Данните не подкрепят твърдението, че вероятността гълъб от 
# дадения вид да намери пътя към дома си е над 51%.


###
# zad67 a
# p = вероятност стока в хипермаркета да е с грешна цена
# H0: p = 0.075
# H1: p != 0.075

x <- 14
n <- 200
p <- 0.075
z.obs <- (x/n - p)/sqrt(p*(1-p)/n)
z.obs
p.value <- 2*(1-pnorm(abs(z.obs)))
p.value

prop.test( x=14, n=200, p=0.075, correct=F )

# p.value = 0.7883 > 0.05
# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основания да твърдим, че процентът на стоки с 
# грешна цена се е променил спрямо 2009 година.


###
# zad67 b
# p = вероятност стока в хипермаркета да е с грешна цена
# H0: p = 0.075
# H1: p < 0.075

x <- 14
n <- 200
p <- 0.075
z.obs <- (x/n - p)/sqrt(p*(1-p)/n)
z.obs
p.value <- pnorm(z.obs)
p.value

prop.test( x=14, n=200, p=0.075, alternative="less", correct=F )

# p.value = 0.3942 > 0.05
# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основания да твърдим, че процентът на стоки с 
# грешна цена е намалял спрямо 2009 година.


###
# zad68
# mu = средно количество течност, което налива автоматът
# H0: mu = 170
# H1: mu < 170

x.bar <- 168
sigma <- 3.9
n <- 50
mu <- 170

z.obs <- (x.bar-mu)/(sigma/sqrt(n))
z.obs
p.value <- pnorm(z.obs)
p.value

# p.value = 0.00014 < 0.05 
# => отхвърляме нулевата хипотеза в полза на алтернативната.
# Имаме основание да твърдим, че в средно автоматът налива 
# по-малко от 170 грама.


###
# zad69 a
# mu = средно ниво на хемоглобин при децата страдащи от болестта
# H0: mu = 14.6
# H1: mu != 14.6

x <- c(12.3, 11.4, 14.2, 15.3, 14.8, 13.8, 11.1, 15.1, 15.8, 13.2)
mu <- 14.6
n <- length(x)
t.obs <- (mean(x)-mu)/(sd(x)/sqrt(n))
t.obs
p.value <- 2*(1-pt(abs(t.obs), n-1))
p.value 

t.test( x, mu=14.6 )

# p.value = 0.1197 > 0.05
# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основание да твърдим, че средното ниво на хемоглобин при 
# децата страдащи от тази болест е различно от нормалното ниво от 14.6.


###
# zad69 b
# mu = средно ниво на хемоглобин при децата страдащи от болестта
# H0: mu = 14.6
# H1: mu < 14.6

x <- c(12.3, 11.4, 14.2, 15.3, 14.8, 13.8, 11.1, 15.1, 15.8, 13.2)
mu <- 14.6
n <- length(x)
t.obs <- (mean(x)-mu)/(sd(x)/sqrt(n))
t.obs
p.value <- pt(t.obs, n-1)
p.value 

t.test( x, mu=14.6, alternative="less" )

# p.value = 0.0598 > 0.05
# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основание да твърдим, че средното ниво на хемоглобин при 
# децата страдащи от тази болест е по-малко от 14.6.


###

